#include "prototype.h"

int sc_memoryInit () //инициализирует массив из 100 элементов
{

}

int sc_memorySet()// устанавливает значение блока памяти
{

}

int sc_memoryGet ()//получает значение блока памяти и возвращет его в переменную
{

}

int sc_memorySave()//сохраняет память в бинарный файл
{

}

int sc_memoryLoad()//загружает оперативную память из файла
{

}

int sc_regInit()//инициализирует регистр флагов с 0
{

}

int sc_regSet()//устанавливает значение регистра флага #define-s используются для номера регистров, если неверный номер регистра то ошибка
{

}

int sc_regGet()//получает значение флага, если неверный регистр, то ошибка
{

}

int sc_commandEncode ()//кодирует команду с определенным номером и операндом, помещает результат в значение, если он неправильный то команда или операнд выдают ошибку,значение не меняется.
{

}

int sc_commandDecode ()//декодирует значение как комнаду sc,если декодировавние невозможно устанавливает команду error и возвразает ошибку.  
{

}